import 'package:election_exit_poll_07610567/helpers/platform_aware_asset_image.dart';
import 'package:election_exit_poll_07610567/models/food_item.dart';
import 'package:election_exit_poll_07610567/models/new_item.dart';
import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

import 'news_details_page.dart';

class NewsPagePoliticsPage extends StatefulWidget {
  static const routeName = '/food_list_page';

  const NewsPagePoliticsPage ({Key? key}) : super(key: key);

  @override
  _NewsPagePoliticsPage  createState() => _NewsPagePoliticsPage ();
}

class _NewsPagePoliticsPage  extends State<NewsPagePoliticsPage > {

  var newsitems = [
    NewsItem(
      id: 1,
      title: 'ทักษิณส่งซิกเบรก 112 ก้าวไกลปัดละเมิดสถาบัน ชงยกเว้นโทษติชมโดยสุจริต',
      content: 'ก้าวไกลเดินหน้ากระทุ้งแก้ ม.112 เต็มสูบ ท้วง “ชวน” ไม่นำเข้าสภาฯ ยันไม่ละเมิดสถาบันขัด รธน. เพื่อไทย ถอยขอแค่เป็นตัวกลาง หลัง “ทักษิณ” ส่งซิกเป็นนายกฯเคยใช้แล้วไร้ปัญหา ซัดคนบังคับใช้ปัจจุบันไม่ยึด'
          'หลักนิติธรรม กลุ่มแคร์ ไม่แคร์นายใหญ่หนุนฝ่ายขอแก้ “บิ๊กตู่” ขออย่าทำลายสิ่งคนไทยเคารพนับถือสืบทอดกันมา “เสี่ยหนู” ยัน ภท.ไม่มีแตะ งามไส้เปิดสภานัดแรกสภาส่อล่มองค์ประชุมร่อยหรอ “สุชาติ”ชิงปิดประชุม '
          'พปชร.เร่งเฟ้นประธานวิปรัฐบาลแทน “วิรัช” “ลุงตู่” รอคุย “ลุงป้อม” ก่อนเซ็นตั้งชื่อ “นิโรธ” เต็งหนึ่งนอนมา ขณะที่ศาล รธน.สั่ง ส.ส.ภูมิใจไทยหยุดทำหน้าที่อีกราย',
      date: 'วันที่ 4/11/2021',
      image: '1-p.png',
    ),
    NewsItem(
      id: 2,
      title: 'ก้าวไกล ไม่หวั่นถูกยุบพรรค มองคำวินิจฉัยศาลรัฐธรรมนูญอาจจุดระเบิดทางสังคม',
      content: 'พรรคก้าวไกล ยืนยันว่า การคลี่คลายปัญหาความเห็นแตกต่างทางเมืองในปัจจุบัน ต้องอาศัยการเปิดความจริงอันน่ากระอักกระอ่วนใจแห่งยุคสมัยอย่างถูกต้อง อย่ามองว่านี่เป็นภัยของชาติ อย่ามองอนาคตของชาติเป็นศัตรู และต้องพยายามแสวงหากุศโลบายที่ดีในการรักษาความสัมพันธ์ระหว่างสถาบันพระมหากษัตริย์ต่อสังคมประชาธิปไตยสมัยใหม่ให้ได้ แต่คำวินิจฉัยของศาลรัฐธรรมนูญเมื่อวานนี้จะยิ่งทำให้สังคมไทยหนีห่างออกจากเส้นทางนี้มากขึ้นเรื่อยๆ จนอาจจะส่งผลให้เกิดความรุนแรงในสังคมได้ในอนาคต ซึ่งหากเป็นเช่นนั้นศาลรัฐธรรมนูญและเครือข่าย ต้องมีส่วนในการรับผิดชอบ”',
      date: 'วันที่ 11/11/2021',
      image: '2-p.png',
    ),
    NewsItem(
      id: 3,
      title: 'นายกฯ กล่าวเปิดหลักสูตร วปอ. รุ่น 64 ย้ำ ทุกคนมีส่วนสำคัญช่วยปกป้องประเทศ',
      content: 'กวันที่ 11 พ.ย. 2564 นายธนกร วังบุญคงชนะ โฆษกประจำสำนักนายกรัฐมนตรี เปิดเผยว่า วันนี้ พล.อ.ประยุทธ์ จันทร์โอชา นายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงกลาโหม เป็นประธานในพิธีเปิดการศึกษาหลักสูตรการป้องกันราชอาณาจักร (วปอ.) รุ่นที่ 64 มีผู้เข้ารับการศึกษา 288 คน และนักศึกษาจากมิตรประเทศ ได้แก่ ราชอาณาจักรกัมพูชา สาธารณรัฐอินเดีย สาธารณรัฐอินโดนีเซีย สหพันธรัฐ มาเลเซีย สาธารณรัฐอิสลามปากีสถาน สหราชอาณาจักร และสาธารณรัฐสังคมนิยมเวียดนาม โดยนายกรัฐมนตรีหวังว่า ตลอดระยะเวลาของการเข้ารับการศึกษา นักศึกษาทุกคนจะนำเอาความรู้ ความสามารถ และประสบการณ์ของแต่ละคนมาแลกเปลี่ยนเรียนรู้กันให้เกิดประโยชน์ต่อประเทศชาติ ',
      date: 'วันที่ 11/11/2021',
      image: '3-p.png',
    ),
    NewsItem(
      id: 4,
      title: 'ทนายกฯ สั่งเข้มทุกหน่วยงานเร่งสำรวจถนน ไฟริมทาง หวั่นซ้ำรอยหนุ่มขับรถตกน้ำ',
      content: 'กวันที่ 11 พ.ย. 2564 นายธนกร วังบุญคงชนะ โฆษกประจำสำนักนายกรัฐมนตรี เปิดเผยว่า พลเอก ประยุทธ์ จันทร์โอชา นายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงกลาโหม กำชับทุกส่วนราชการที่เกี่ยวข้องกับการดูแลพื้นที่สาธารณประโยชน์ทุกแห่ง ทั้งกระทรวงคมนาคม กรมทางหลวง กรมทางหลวงชนบท กรมเจ้าท่า การรถไฟแห่งประเทศไทย การไฟฟ้าส่วนภูมิภาค และ อปท. ทุกแห่ง เร่งสำรวจสภาพถนน สะพาน ไม้กั้นทางรถไฟ ป้ายและระบบสัญญาณไฟฟ้าจราจร ไฟฟ้าริมทาง ให้อยู่ในสภาพที่ใช้งานได้ รวมทั้งให้มีการติดตั้งไฟฟ้าแสงสว่าง ติดตั้งป้ายแจ้งเตือน เพื่อป้องกันไม่ให้เกิดอันตรายแก่ผู้ใช้เส้นทาง ซึ่งคาดว่าหลังจากนี้จนถึงต้นปีหน้า จะมีการเดินทางของประชาชนมากขึ้น เนื่องจากเป็นวันหยุดเทศกาลปีใหม่ รวมถึงจากการปรับมาตรการของศูนย์บริการสถานการณ์แพร่ระบาดของโรคติดเชื้อไวรัสโคโรนา 2019 (โควิด-19) หรือ ศบค. ที่สามารถให้ประชาชนเดินทางข้ามจังหวัดได้ นายกรัฐมนตรีจึงมีความห่วงใยประชาชนในการใช้รถ ใช้ถนน เป็นอย่างยิ่ง และต้องการลดสาเหตุที่จะทำให้เกิดอุบัติเหตุ เสียหายต่อชีวิตหรือทรัพย์สินของพี่น้องประชาชน รวมทั้งให้เร่งปรับปรุงเส้นทางและสาธารณูปโภคที่ได้รับความเสียหายจากอุทกทัย น้ำท่วมถนน หรือน้ำกัดเซาะทำให้เส้นทางขาด เพื่อการเดินทางที่ปลอดภัยแก่ประชาชน และป้องกันไม่ให้เกิดเหตุการณ์ซ้ำรอยที่จังหวัดนครสวรรค์',
      date: 'วันที่ 11/11/2021',
      image: '4-p.png',
    ),
    NewsItem(
      id: 5,
      title: 'คณะก้าวหน้า เปิดตัว 3 ผู้สมัคร อบต. เมืองปากน้ำ ขอโอกาส ยันจะไม่ทุจริต',
      content: 'กวันที่ 11 พ.ย. 2564 ที่ แอทเลท อีเว้นท์แอนด์สตูดิโอ จ.สมุทรปราการ นายธนาธร จึงรุ่งเรืองกิจ ประธานคณะก้าวหน้า พร้อมด้วยกรรมการบริหารคณะก้าวหน้า อาทิ นายไกลก้อง ไวทยการ และ น.ส.พรรณิการ์ วานิช ร่วมงานแสดงวิสัยทัศน์และเปิดตัวผู้สมัครรับเลือกตั้งเป็นนายกองค์การบริหารส่วนตำบล (อบต.) 3 แห่งใน จ.สมุทรปราการ ได้แก่ อบต.ราชาเทวะ, อบต.บางพลีใหญ่ และ อบต.บางปลา ซึ่งเป็น อบต.ขนาดใหญ่ มีงบประมาณเป็นอันดับต้นๆ ของประเทศ โดยทั้ง 3 อบต. มีตั้งแต่โรงงานอุตสาหกรรมขนาดใหญ่ โรงงานอุตสาหกรรมที่ใช้เทคโนโลยีขั้นสูง ห้างสรรพสินค้าขนาดใหญ่หลายแห่ง และยังมีอาชีพเกษตรกรรมทำบ่อกุ้งและบ่อปลา ขณะเดียวกันก็มีหมู่บ้านจัดสรร รวมถึงชุมชนดั้งเดิมซึ่งในความหลากหลายนี้เองที่ทำให้เกิดปัญหาความเหลื่อมล้ำที่จะต้องได้รับการแก้ไข',
      date: 'วันที่ 11/11/2021',
      image: '5-p.png',
    ),
  ];


  @override
  Widget build(BuildContext context) {
    return Container(
      child: ListView.builder(
        padding: EdgeInsets.all(8.0),
        itemCount: newsitems.length,
        itemBuilder: (BuildContext context, int index) {
          var newsItem = newsitems[index];

          return Card(
            clipBehavior: Clip.antiAliasWithSaveLayer,
            margin: EdgeInsets.all(8.0),
            elevation: 5.0,
            shadowColor: Colors.black.withOpacity(0.2),
            child: InkWell(
              onTap: () => _handleClickFoodItem(newsItem),
              child: Row(
                children: <Widget>[
                  PlatformAwareAssetImage(
                    assetPath: 'assets/images/${newsItem.image}',
                    width: 80.0,
                    height: 80.0,
                    fit: BoxFit.cover,
                  ),
                  /*Image.asset(
                    'assets/images/${foodItem.image}',
                    width: 80.0,
                    height: 80.0,
                    fit: BoxFit.cover,
                  ),*/
                  Expanded(
                    child: Container(
                      padding: EdgeInsets.all(10.0),
                      child: Row(
                        mainAxisAlignment: MainAxisAlignment.spaceBetween,
                        children: <Widget>[
                          Column(
                            crossAxisAlignment: CrossAxisAlignment.start,
                            children: <Widget>[
                              Text(
                                '${newsItem.title}',
                                style: GoogleFonts.prompt(fontSize: 10.0),
                              ),
                            ],
                          ),
                        ],
                      ),
                    ),
                  ),
                ],
              ),
            ),
          );
        },
      ),
    );
  }

  _handleClickFoodItem(NewsItem newsItem) {
    Navigator.pushNamed(
      context,
      NewsDetailsPage.routeName,
      arguments: newsItem,
    );
  }
}
